// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//

let num1 = +prompt('введіть перше число', '');
let num2 = +prompt('введіть друге число', '');
if (num1 > num2) {
    alert(num1);
} else if (num1 === num2) {
    alert('числа однакові');
} else {
    alert(num2);
}

//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let apartNum = +prompt('введіть номер вашої квартири', '');

if (apartNum > 1 && apartNum <= 20) {
    alert("Ваш під'їзд під номером 1");
} else if (apartNum > 20 && apartNum <= 48) {
    alert("Ваш під'їзд під номером 2");
} else if (apartNum > 48 && apartNum <= 90) {
    alert("Ваш під'їзд під номером 3");
} else {
    alert('невірно вказиний номер квартири')
}


//
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = +prompt('введіть 10', '');
number === 10 ? alert('ВІРНО') : alert('НЕВІРНО');

//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

let x;
if (typeof x === 'number') {
    alert(1);
} else if (typeof x === 'string') {
    alert(2);
} else if (typeof x === 'boolean' || typeof x === 'object') {
    alert(3);
} else {

}

//
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temp = +prompt('яка у вас температура?', '');
if (temp >= 10 && temp <= 22) {
    alert('ми йдемо ВЧИТИСЯ');
} else {
    alert('сидимо вдома і вчимося ОНЛАЙН');
}

//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let secretNum = +prompt('Введіть число від 1 до 5', '');

switch (secretNum) {
    case 1:
        alert('Ви виграли авто! (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧');
        break;
    case 2:
        alert('Ви виграли мотоцикл! (´｡• ω •｡)');
        break;
    case 3:
        alert('Ви виграли телефон! (๑˘︶˘๑)');
        break;
    case 4:
        alert('Ви виграли велосипед! (＾▽＾)');
        break;
    case 5:
        alert('Ви виграли кружку! ¯\\_(ツ)_/¯');
        break;
    default:
        alert('Ви ввели невірне число! (´｡• ᵕ •｡)');
}